## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 3 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `aws_eks_node_group.notification-canada-ca-eks-secondary-node-group[0]`  |
|        | `aws_iam_instance_profile.karpenter`                                     |
|        | `aws_iam_role_policy.karpenter_controller`                               |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-cni`                   |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-ecr`                   |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-managed-instance-core` |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-worker-node`           |
|        | `aws_iam_role_policy_attachment.karpenter_ssm_policy`                    |
|        | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`               |
| delete | `aws_alb_target_group.admin_secondary`                                   |
|        | `aws_alb_target_group.api_secondary`                                     |
|        | `aws_alb_target_group.doc_api_secondary`                                 |
|        | `aws_alb_target_group.document_secondary`                                |
| update | `aws_eks_node_group.notification-canada-ca-eks-node-group`               |
|        | `aws_iam_role.eks-cluster-role`                                          |
|        | `aws_security_group.notification-canada-ca-worker`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_alb_target_group.admin_secondary will be destroyed
  # (because aws_alb_target_group.admin_secondary is not in configuration)
  - resource "aws_alb_target_group" "admin_secondary" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/admin-secondary/dbca992edd53ac7e" -> null
      - arn_suffix                         = "targetgroup/admin-secondary/dbca992edd53ac7e" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/admin-secondary/dbca992edd53ac7e" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "admin-secondary" -> null
      - port                               = 6012 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-0e02e0295db594518" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/_status?simple=true" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_alb_target_group.api_secondary will be destroyed
  # (because aws_alb_target_group.api_secondary is not in configuration)
  - resource "aws_alb_target_group" "api_secondary" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/k8s-api-secondary/a73736be8fb11789" -> null
      - arn_suffix                         = "targetgroup/k8s-api-secondary/a73736be8fb11789" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/k8s-api-secondary/a73736be8fb11789" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "k8s-api-secondary" -> null
      - port                               = 6011 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-0e02e0295db594518" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/_status?simple=true" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_alb_target_group.doc_api_secondary will be destroyed
  # (because aws_alb_target_group.doc_api_secondary is not in configuration)
  - resource "aws_alb_target_group" "doc_api_secondary" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/doc-api-secondary/c2c171b0612d97c0" -> null
      - arn_suffix                         = "targetgroup/doc-api-secondary/c2c171b0612d97c0" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/doc-api-secondary/c2c171b0612d97c0" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "doc-api-secondary" -> null
      - port                               = 7000 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-0e02e0295db594518" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/_status" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_alb_target_group.document_secondary will be destroyed
  # (because aws_alb_target_group.document_secondary is not in configuration)
  - resource "aws_alb_target_group" "document_secondary" {
      - arn                                = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/document-secondary/c5846bbc8f3c72c6" -> null
      - arn_suffix                         = "targetgroup/document-secondary/c5846bbc8f3c72c6" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/document-secondary/c5846bbc8f3c72c6" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "document-secondary" -> null
      - port                               = 7001 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-0e02e0295db594518" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/_status" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group" {
        id              = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group"
      ~ tags            = {
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
            # (2 unchanged elements hidden)
        }
      ~ tags_all        = {
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-secondary-node-group[0] will be created
  + resource "aws_eks_node_group" "notification-canada-ca-eks-secondary-node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "notification-canada-ca-production-eks-cluster"
      + disk_size              = 80
      + id                     = (known after apply)
      + instance_types         = [
          + "r5.large",
        ]
      + node_group_name        = "notification-canada-ca-production-eks-secondary-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::296255494825:role/eks-worker-role"
      + release_version        = "1.27.4-20230825"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-003252752c8a83c9f",
          + "subnet-0372dd9f5c68cdf14",
          + "subnet-0c68946095ba18faf",
        ]
      + tags                   = {
          + "CostCenter"             = "notification-canada-ca-production"
          + "Name"                   = "notification-canada-ca"
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
      + tags_all               = {
          + "CostCenter"             = "notification-canada-ca-production"
          + "Name"                   = "notification-canada-ca"
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 5
          + max_size     = 7
          + min_size     = 4
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_instance_profile.karpenter will be created
  + resource "aws_iam_instance_profile" "karpenter" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "KarpenterNodeInstanceProfile-karpenter-controller-eks"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "eks-worker-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.eks-cluster-role will be updated in-place
  ~ resource "aws_iam_role" "eks-cluster-role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "eks-cluster-role"
        name                  = "eks-cluster-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy.karpenter_controller will be created
  + resource "aws_iam_role_policy" "karpenter_controller" {
      + id     = (known after apply)
      + name   = "karpenter-policy-notification-canada-ca-production-eks-cluster"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "iam:PassRole",
                          + "ec2:DescribeImages",
                          + "ec2:RunInstances",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateTags",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:TerminateInstances",
                          + "ec2:DescribeSpotPriceHistory",
                          + "pricing:GetProducts",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "karpenter-controller-eks"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-cni will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "karpenter-controller-eks"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-ecr will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-ecr" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "karpenter-controller-eks"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-managed-instance-core will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-managed-instance-core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "karpenter-controller-eks"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-worker-node will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-worker-node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "karpenter-controller-eks"
    }

  # aws_iam_role_policy_attachment.karpenter_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-worker-role"
    }

  # aws_security_group.notification-canada-ca-worker will be updated in-place
  ~ resource "aws_security_group" "notification-canada-ca-worker" {
        id                     = "sg-036cf176cc9de6feb"
        name                   = "notification-canada-ca-worker"
      ~ tags                   = {
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          + "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "karpenter-controller-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 9 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  - admin_secondary            = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/admin-secondary/dbca992edd53ac7e" -> null
  - api_secondary              = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/k8s-api-secondary/a73736be8fb11789" -> null
  - doc_api_secondary          = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/doc-api-secondary/c2c171b0612d97c0" -> null
  - document_secondary         = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:targetgroup/document-secondary/c5846bbc8f3c72c6" -> null
  + eks_cluster_endpoint       = "https://BB1100A5BF4708019EB3830B49BF6B60.sk1.ca-central-1.eks.amazonaws.com"
  + karpenter_iam_role_arn     = (known after apply)
  + karpenter_instance_profile = "KarpenterNodeInstanceProfile-karpenter-controller-eks"

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
